'''



# 我更新了尘封两年的地球小程序，而且仍然相信它的价值

## 1. 尘封已久的“星球点灯人”
2021年底“星球点灯人”第一个网页版本刚刚发布的场景，现在回想起来都有点像电视剧。我依稀记得当时在机场候机，朋友发消息和我说，你这个小网页火了，而且出了bug，赶紧去修，我就赶紧在候机厅打开电脑debug，一打开就看见排行榜上一下子多了几百个人。后来那一两天打开朋友圈，到处我那篇关于”星球点灯人“的文章。那几天我收到的消息也非常之多，有网友私信我表示非常喜欢，有投资人私信我可以投资，有老师老板转发说这小伙有前途，还有朋友找我说想一起做做这个项目。非常dramatic的事情是，当时的我恰恰刚刚经历了人生中非常低谷的一些事情。这个小网页的小小火爆让我感到了一丝温暖，也让我对未来重拾了一些信心。

【img： hot】

后来我就鼓起勇气再好好去做这个项目。我在朋友圈发了个招募消息，想找一些朋友一起兼职地做好这个程序，甚至是以后更多的产品。结果很鼓舞人心，一下子有30多个朋友或者朋友的朋友主动联系我，表示愿意参与。我当时觉得这个项目的未来一片光明，甚至要孕育出一个初创团队来了的样子。

不过，后来的事情并没有那么顺利。团队的兴奋逐渐消退，产品路线不甚清晰，管理和激励也稀里糊涂，迁移微信小程序的计划也实施得磕磕绊绊。不仅如此，我当时也并没能很快从之前的低谷中恢复过来，做人做得一会癫狂，一会摆烂，而且毕竟也缺乏很多经验，最后也没能把团队一直团结下去。

【img：working times】

但我一直没有完全放弃这个东西。22年4月，我终于完成了从网页到小程序的迁移，正式发布了微信小程序版本的“星球点灯人”v1.0。这次更新其实蛮不容易，包括了很多重要的内容。比如数据上的工作，之前的网页版是300个世界城市，这次更新增加了300多个中国城市，这其中不少数据收集、清洗、整理的工作都还蛮耗时耗力。还有一个重要的改动是把选择东西南北改成了更有“爽感”的长按旋转起飞选择方向，这个是当时团队还在时群策群力的想法，实现起来也颇有难度，但总算成功了。

不过最头疼的还是迁移本身。由于微信小程序的前端架构和浏览器的网页大有不同————尤其是对高质量动画的支持这方面————导致我当时只好重头重写一个全新的项目，用一些第三方库把three.js包进微信支持的canvas里。这其实是一个不得已的下下策。其实是有一些更好的方案的，比如直接去用cocos creator写微信小游戏，但当时团队里并没有谁有能力做这件事情。而且像地球的3d渲染、从latitude longitude的转换、城市之间的飞行和轨迹动画，这些刚刚艰难攻克过的问题，如果要重新来一遍就算了，还要换一个完全不同的技术栈再来一遍，这简直是要了我的命。于是最终呈现在大家眼前的第一版微信小程序，效果上其实比火了的那一版大打折扣，UI、动画、以及地球的画质退步了不少。这其实更多地也是无奈的选择。这个版本没有引起什么关注和好评，似乎也就顺理成章了。

【img：v1.0】

颗粒无收的滋味，于是第一个小程序版本发布后，我也灰心了一段时间。不过，我还是一直在断断续续地完善它。2022年10月，微信小程序“星球点灯人”v2.0发布了，这次更新主要引入了收集系统，允许用户可以收集自己跳跃成功的城市，并且可以看到一个精致的小卡片。除此之外，首页、结算页、城市跳跃页、排行页都有许多点点滴滴的优化和更新。不过，我个人对这次更新的满意度也并不高，虽然每一个细节都需要花费很多心思，但整体上还有一些比较重大的问题————尤其是地球的画质和性能提升问题，我一直没法攻克，因此也就没有用力宣传这次更新。

【img：v2.0】

自那以后，这个小程序就陷入了一段相当漫长的沉寂期。我渐渐觉得，比起增加这个功能，提升那个方面，停下来好好想一想，这个小程序究竟有没有价值、有什么价值？还值不值得继续做下去？怎么做下去才能让它发挥出它的价值？如果我想要让它成为一款成功的小产品，必须对这些问题有坚定的、清晰的、以及现实的答案。

这个问题一想就是两年。





## 2. 技术价值、商业价值之外


## 3. 颠簸坎坷的更新之路


## 4. 改名“奇怪地球仪”发布，它还会有未来的




'''·